# Исходные данные
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

# Создаем пустые списки для простых и непростых чисел
primes = []
not_primes = []

# Перебираем числа из списка numbers
for number in numbers:
    # Пропускаем число 1, так как оно ни простое, ни составное
    if number == 1:
        continue

    # Предполагаем, что число простое
    is_prime = True

    # Проверяем делимость числа, начиная с 2 и до числа-1 (включительно)
    for i in range(2, int(number ** 0.5) + 1):  # Проверяем делители до квадратного корня из числа
        if number % i == 0:
            is_prime = False
            break  # Если нашли делитель, то число не простое, выходим из цикла

    # В зависимости от результата проверки добавляем число в соответствующий список
    if is_prime:
        primes.append(number)
    else:
        not_primes.append(number)

# Выводим результаты
print("Primes:", primes)
print("Not Primes:", not_primes)
