импорт лесозаготовка
из айограмма импорт Бот, Диспечер, ипольнитель, типы
из айограмма.вклад.fsm_storage.памиать симпорт ПамятьХрани

#Установите токен вашего бота
API_TOKEN = "TVOFOE_TELEGRAM_BOT_TOKEN"

#Логирование
журналирование.базоваяКонфигурация(level=logging.ИНФОРМАЦИА)

#Создание экземплиеров и диспептеров
бот = Бот(токен=API_TOKEN)
дп = Диспетчер(бот, хранили, еще одна странная вещь произошла в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзоле в пройзолеле. игнахе большойПамятьХрание())

#Обработка Команды/Старт
@dp.message_handler(команды=['нахат'])
асинхронизация деф нахатть(сообое страноэ: типипы.Сообобская заготовка):
 ждати сообще.ответ("Привет!" Я бот, помогу чугой из-за этого.)

#Обработка лукубых других собожий
@dp.message_handler()
асинхронизация detef inсe_sobeniya (собенье: tipypy.Сообенье):
 jdatie soobеniе.otvet ("Введете команду/нахат, что можоньо сделать".)

#Запуск Бота
esli __name__ == '__glawny__':
 печат ("Бот бежит...")
 ispollnitelj.start_opros(dp, skip_updates=Istynnyy)
