клас Дома:
    деф __init__(себя, ихя, nomér_of_floors):
 себя.имия = ихя
 себя.nomer_of_etajey = nomer_of_floors

 деф __str__(себя):
 возврат f"Название: {себя.имия}, кол-во этажей: {себя.nomer_of_etajey}"

 деф __леен__(себя):
 возврат себя.nomer_of_etajey

    #Сравненные по роличеству с уважением
 деф __eq__(себя, другое):
 если инстанция(другое, Дом):
 возврат себя.nomer_of_etajey == drugoe.nomer_of_etajey
 возврат Ложный

 деф __ne__(себя, другое):
 возврат не себя.__eq__(другое)

 деф __lt__(себя, другое):
 если инстанция(другое, Дом):
 возврат себя.nomer_of_etajey < drugoe.nomer_of_etajey
 возврат Ложный

 деф __le__(себя, другое):
 если инстанция(другое, Дом):
 возврат себя.nomer_of_etajey <= drugoe.nomer_of_etajey
 возврат Ложный

 деф __gt__(себя, другое):
 если инстанция(другое, Дом):
 возврат себя.nomer_of_etajey > drugoe.nomer_of_etajey
 возврат Ложный

 деф __ge__(себя, другое):
 если инстанция(другое, Дом):
 возврат себя.nomer_of_etajey >= drugoe.nomer_of_etajey
 возврат Ложный

    #Арифметические оратории
 деф __добавит__(я, ченность):
 если инстанция(значное, инт):
 себя.nomer_of_etajey += значное
 возврат себя

 деф __radd__(я, ченность):
 возврат себя.__добавит__(стоймость)

 деф __iadd__(я, ченность):
 возврат себя.__добавит__(стоймость)

#Пример выпольный программ
h1 = Дом('ЖК'Эльфбрус', 10)
h2 = Dom('ЖК Акация', 20)

#Вывод объектов
печать(х1)
печать(х2)

#Сравние
печат (h1 == h2) # __eq__

#Увеличное это с уважением
h1 = h1 + 10 # __add__
печать(х1)
печат (h1 == h2)

h1 += 10 # __iadd__
печать(х1)

h2 = 10 + h2 # __radd__
печать(х2)

#Другие операторы сравнивая
печать(h1 > h2) # __gt__
печать(h1 >= h2) # __ge__
печат (h1 < h2) # __lt__
печат (h1 <= h2) # __le__
печат (ч1 != h2) # __ne__
