деф добавиты_vse_vvеrх(а, ббб):
 попробуй:
        #Попытка сложит и б как числа или строки
 результат = a + b
 возврат результат
 крама ТипОшибка:
        #Obrabobotka situatci, cogda typy a ib raznye (например, int & str)
 возврат стр(a) + стр(b)

#Пример использования
печать(добавиты_vse_vvеrх(123,456, 'строка'))  #Ожидаемый вывод: '123.456строка'
печать(добавиты_vse_vvеrх('яблоко', 4215))     #Ожидаемый вывод: 'яблоко4215'
печать(добавиты_vse_vvеrх(123,456, 7))         #Ожидаемый вывод: 130.456
