клас Дома:
 doma_istoriya = []  #Атрибут класа для храниа истории домов

 деф __novy__(клс, *аргс, **кварги):
        #Создание нового объекта
 экземпляра = супер().__novy__(cls)
        
        #Добавлем Нацваний Дома (первый аргумент в эргументах) в изориусе
 клс.тома_история.добавлятль(аргс[0])
        
 возврат экземпляра

 деф __init__(себя, ихя, полы):
 себя.имия = ихя
 себя.этажи = этажей

 деф __delj__(себя):
        #Сообщеприходство при удалении объектовы
        печать(ф "{sebya.imymya} снесён, не он останеця в истории")

    #Переопредложение metoda __len__
 деф __leеn__(себя):
 возврат себя.этажи

    #Переопредложение metoda __str__
 деф __str__(себя):
 возврат f"Название: {себя.имия}, кол-во этажей: {себя.этажи}"

#Создание объектов дома класа
h1 = Дом('ЖК'Эльфбрус', 10)
h2 = Дом('ЖК Акация', 20)

#Проверка Работы __str__
печеть(х1) #Название: ЖК Элбрус, кол-во этажей: 10
печеть(х2) #Название: ЖК Акация, кол-во этажей: 20

#Проверка Работы __len__
печать(лен(х1)) №10
печать(лен(х2)) №20
