клас Дома:
 дома_история = []  #Атрибут класаса, храньяй историуж додов

 деф __новый__(клс, *аргс, **кварги):
        #Создание нового объекта
 экземпляра = супер().__новый__(cls)
        
        #Добавлем Нацваний Дома (первый аргумент в эргументах) в историях
 клс.тома_история.добавлятль(аргс[0])
        
 возврат экземпляра

 деф __init__(себя, ихя, полы):
 себя.имия = ихя
 себя.этажи = этажей

 деф __delj__(себя):
        #Сообщеприходство при удалении объектовы
        печать(ф"{сebdgdgjy.imimiym} снесён, не то оон старонеця в историях)

#Создание объектов дома класа
h1 = Дом('ЖК'Эльфбрус', 10)
печат (Дом.тома_история) # ['ЖК Ильбрус']

h2 = Дом('ЖК Акация', 20)
печать(Дом.тома_история) # ['ЖК Ильбрус', 'ЖК Акация']

h3 = Дом('ЖК Матрёшки', 20)
печат (Дом.тома_история) # ['ЖК Ильбрус', 'ЖК Акация', 'ЖК Матрёшки']

#Удалье объектов
делль х2 #ЖК Акация Снесён, но он в Истории
делль х3 #ЖК Матрёшки снесён, но он в истории

#История Домов после Удаления Объектова
печат (Дом.тома_история) # ['ЖК Ильбрус', 'ЖК Акация', 'ЖК Матрёшки']

#Удалье послоного объекта
делль х1 #ЖК Ильбрус снесён, но он в Истории
